(function(){
 //配置数据
 var _gameConfig={
   //每一盘的时间	  
   "time":60,
   //回合数
   "round":2,   
   //题目类型
   "qtype":["成语","职业","动物","动漫人物"],
   "score":[3,2,1],
   //题目数据
   "qdata":[
	  ["天人合一","五体投地","亡羊补牢","掩耳盗铃","一寸光阴一寸金"],
      ["教师","学生","程序员","歌手","训兽师","模特","演员"],
	  ["老鼠","老虎","蟑螂","蚂蚁","老鹰","蟒蛇","兔子"],
      ["蜡笔小新","奥特曼","蜡笔小新","葫芦娃","超人","钢铁侠","孙悟空","铁臂阿童木"]
	 ]
 }
 //当前游戏数据信息
 var _gameInfo ={
   //当前画图的用户索引
   "uIdx":-1,  
   //当前画图的用户	   
   "user":null,
   //当前问题
   "question":{"type":null,"data":null},
   //当前游戏进行时间
   "time":0, 
   //当前进行的回合数
   "round":0,
   "status":0,//游戏状态，0：未开始 1：已开始 :2:结束一轮问题,
   "rUserCount":0,//记录答对游戏人数
   "rUser":null//第一个答对的用户
 }
 //输出模块
 exports.gameData = function()
  {
	 return {
       "cfg":_gameConfig,  
       "info":_gameInfo 
	 };
  }
}())